; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v6)
             (pred_4 ?v8 ?v12)
             (pred_12 ?v4 ?v12)
             (pred_9 ?v13 ?v4 )
	     (pred_2 ?v4)
             (pred_10 ?v3)
             (pred_11 ?v8)
             (pred_1 ?v12)
             (pred_7 ?v4)
             (pred_6 ?v8)
             (pred_5 ?v4)
             (pred_8 ))



(:action op_4
:parameters (?v5 ?v7 ?v2 ?v1)
:precondition (and (pred_10 ?v5) (pred_10 ?v7) (pred_11 ?v2) (pred_1 ?v1)
          (pred_3 ?v5 ?v7) (pred_4 ?v2 ?v1)
                   (pred_12 ?v7 ?v1) (pred_2 ?v5) 
                   (pred_7 ?v7) (pred_6 ?v2))
:effect (and  (pred_5 ?v7) (not (pred_7 ?v7))))


(:action op_2
:parameters (?v5 ?v10)
:precondition (and (pred_10 ?v5) (pred_10 ?v10)
               (pred_2 ?v5) (pred_3 ?v5 ?v10) (pred_5 ?v10))
:effect (and (pred_2 ?v10) (not (pred_2 ?v5))))

(:action op_5
:parameters (?v5 ?v2)
:precondition (and (pred_10 ?v5) (pred_11 ?v2) 
                  (pred_2 ?v5) (pred_9 ?v2 ?v5) (pred_8 ))
:effect (and (pred_6 ?v2)
   (not (pred_9 ?v2 ?v5)) (not (pred_8 ))))


(:action op_3
:parameters (?v5 ?v11 ?v9)
:precondition (and (pred_10 ?v5) (pred_11 ?v11) (pred_11 ?v9)
                  (pred_2 ?v5) (pred_6 ?v9) (pred_9 ?v11 ?v5))
:effect (and (pred_6 ?v11) (pred_9 ?v9 ?v5)
        (not (pred_6 ?v9)) (not (pred_9 ?v11 ?v5))))

(:action op_1
:parameters (?v5 ?v2)
:precondition (and (pred_10 ?v5) (pred_11 ?v2) 
                  (pred_2 ?v5) (pred_6 ?v2))
:effect (and (pred_8 ) (pred_9 ?v2 ?v5) (not (pred_6 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_13 obj_07 obj_10 obj_11 obj_03 obj_06 obj_02 obj_12
    obj_04 obj_01
    obj_05 obj_08
    )

    (:init
       (pred_8)

       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_02)
       (pred_10 obj_12)
       (pred_1 obj_04)
       (pred_1 obj_01)
       (pred_11 obj_05)
       (pred_11 obj_08)

       (pred_3 obj_09 obj_10)
       (pred_3 obj_09 obj_13)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_13 obj_09)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_10 obj_11)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_03)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_11 obj_10)
       (pred_3 obj_03 obj_12)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_06 obj_02)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_02 obj_12)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_02 obj_06)
       (pred_3 obj_12 obj_03)
       (pred_3 obj_12 obj_02)
       (pred_7 obj_06)
       (pred_7 obj_07)
       (pred_12  obj_06 obj_04)
       (pred_12  obj_07 obj_01)
       (pred_5 obj_09)
       (pred_5 obj_13)
       (pred_5 obj_10)
       (pred_5 obj_11)
       (pred_5 obj_03)
       (pred_5 obj_02)
       (pred_5 obj_12)

       (pred_4  obj_05 obj_04)
       (pred_4  obj_08 obj_01)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_08 obj_13)
       (pred_2 obj_12)
    )

    (:goal (and
       (pred_9 obj_05 obj_02)
    ))
(:constraints
  (always (not (pred_2 obj_11)))
)
)

; plan
1. (op_2 obj_12 obj_03)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_03)
   goals met: 0 of 1
2. (op_5 obj_03 obj_05)
   deleted: (pred_9 obj_05 obj_03) (pred_8)
   added: (pred_6 obj_05)
   goals met: 0 of 1
3. (op_2 obj_03 obj_12)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_12)
   goals met: 0 of 1
4. (op_2 obj_12 obj_02)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_02)
   goals met: 0 of 1
5. (op_1 obj_02 obj_05)
   deleted: (pred_6 obj_05)
   added: (pred_8) (pred_9 obj_05 obj_02)
   goals met: 1 of 1
